// 名稱,部位,套裝關鍵字,所有技能傷害,雙攻,暴擊傷害,兩極化,BOSS傷害,適應力

unreleaseEquipInfo = [
    ['使徒', '左五', '', 0, 4, 0, 6, 0, 0], 
    ['使徒武器', '武器', '使徒', 0, 0, 0, 0, 0, 0], 
    ['使徒上衣', '上衣', '使徒', 0, 0, 0, 0, 0, 0], 
    ['使徒耳環', '耳環', '使徒', 0, 0, 0, 0, 0, 0], 

    ['滄海遺珠', '左五', '', 0, 4, 0, 4, 0, 2], 
    ['滄海武器', '武器', '滄海', 0, 0, 0, 3, 0, 0], 
    ['滄海支援', '支援', '滄海', 0, 0, 0, 0, 0, 0], 
    ['滄海上衣', '上衣', '滄海', 0, 0, 0, 0, 0, 0], 
    ['滄海下衣', '下衣', '滄海', 0, 0, 0, 0, 0, 0], 

    ['聖光騎士', '左五', '', 4, 0, 0, 2, 0, 5], 
    ['聖光武器', '武器', '聖光', 0, 0, 0, 5, 0, 0], 
    ['聖光支援', '支援', '聖光', 0, 0, 0, 0, 0, 0], 
    ['聖光上衣', '上衣', '聖光', 0, 0, 0, 0, 0, 0], 
    ['聖光下衣', '下衣', '聖光', 0, 0, 0, 0, 0, 0], 
]