keywordDict = {
    // 劍士 - 盧恩騎士
    '이그니션 브레이크': '致命爆裂',

    // 劍士 - 皇家禁衛軍
    '레이 오브 제네시스': '創世之光',
    '캐논 스피어': '加農砲攻擊',
    '배니싱 포인트': '放逐攻擊',

    // 服事 - 大主教
    '쥬덱스': '審判',
    '아도라무스': '謳歌',

    // 服事 - 修羅
    '폭기산탄': '爆氣散彈',
    '지뢰진': '地雷震',

    // 魔法師 - 咒術士
    '화이어 볼트': '火箭術',
    '화이어 볼': '火球術',
    '헬 인페르노': '地獄火焰',
    '커미트': '毀滅彗星',
    '크림즌 록': '碧血隕石',

    // 魔法師 - 妖術師
    '사이킥 웨이브': '超自然波',

    // 商人 - 機械工匠
    '암즈 캐논': '加農砲',

    // 商人 - 基因學者
    '애시드 데몬스트레이션': '強酸火煙瓶投擲',
    '카트 캐논': '手推車加農砲',

    // 弓箭手 - 遊俠
    '애로우 스톰': '箭雨風暴',
    '샤프 슈팅': '銳利射擊',

    // 弓箭手 - 宮廷樂師 & 浪跡舞者
    '서비어 레인스톰': '大暴雨',

    // 盜賊 - 十字斬首者

    // 盜賊 - 魅影追蹤者
    '트라이앵글 샷': '三角射擊',

    // 拳皇

    // 獵靈士
    '에스파': '艾斯弗',
    '에스후': '艾斯帕',

    // 叛亂者
    '해머 오브 갓': '天神憤怒',

    // 影狼 & 朧 - 日影忍者 & 月影忍者
    '홍염화': '火炎花',
    '빙섬창': '冰閃槍',
    '풍인': '風刃',
    '팔방 쿠나이': '八方飛刀',

    // 召喚師 (喵族)
    '개박하 메테오': '貓薄荷隕石',
    '개다래 줄기창': '獼猴桃梗槍',

    // 屬性
    '속성': '屬性',
    '무': '無',
    '화': '火',
    '수': '水',
    '풍': '風',
    '지': '地',
    '독': '毒',
    '염': '念',
    '암': '暗',
    '성': '聖',
    '불사': '不死',

    // 種族
    '악마형': '惡魔種族',
    '불사형': '不死種族',

    // 體型
    '소형': '小型體型',
    '중형': '中型體型',
    '대형': '大型體型',

    // 物理
    '물리': '物理',
    '근접': '近距離',
    '근접 물리 데미지': '近距離物理傷害',
    '원거리 물리 데미지': '遠距離物理傷害',
    '크리티컬 데미지': '暴擊傷害',
    '보스 등급 몬스터에게 주는 물리 데미지': '對 Boss 階級魔物的物理傷害',
    '모든 크기의 적에게 주는 물리 데미지': '對所有體型敵人的物理傷害',
    '소형, 중형 적에게 주는 물리 데미지': '對小型與中型體型敵人的物理傷害',
    '유도 공격 확률': '誘導攻擊',

    // 魔法
    '마법': '魔法',
    '모든 속성 마법 데미지': '所有屬性的魔法傷害',
    // 성속성 마법 데미지 = 聖屬性的魔法傷害
    '속성 마법 데미지': '屬性的魔法傷害',
    '모든 크기 적에게 주는 마법 데미지': '對所有體型敵人的魔法傷害',
    '소형, 중형 적에게 주는 마법 데미지': '對小型與中型體型敵人的魔法傷害',

    // 其他效果
    '고정 캐스팅': '固定詠唱時間',
    '변동 캐스팅': '變動詠唱時間',
    '공격속도 증가.(공격 후딜레이': '攻擊速度增加 (ASPD +',
    '공격 속도 증가(공격 후 딜레이': '攻擊速度增加 (ASPD +',
    '공격 속도 추가 증가(공격 후 딜레이': '攻擊速度追加增加 (ASPD +',
    '감소)': ')',
    '추가 감소)': ')',
    '스킬 쿨타임': '獨立延遲',
    '스킬 후 딜레이': '共通技能後延遲',
    '일반 근접 물리 공격 시, 일정 확률로': '一般近距離物理攻擊時，一定機率',
    '일반 근접 물리 공격 시 일정 확률로': '一般近距離物理攻擊時，一定機率',
    '파괴 불가': '無法破壞',
    '초': '秒',

    // 敘述
    '추가': '追加',
    '데미지': '傷害',
    '추가 증가': '追加增加',
    '초 감소': ' 秒減少',
    '와 함께 장착 시': ' 同時裝備時',
    '과 함께 장착 시': '同時裝備時',
    '과 함께 장착한 경우': '同時裝備時',
    '씩 증가': ' 增加',
    '증가': '增加',
    '감소': '減少',
    '발동': '發動',

    // 一般說明
    '계열': '系列',
    '무기': '武器',
    '투구': '頭飾',
    '위치': '部位',
    '상단': '上段',
    '갑옷': '鎧甲',
    '걸칠것': '披肩',
    '신발': '鞋子',
    '공격': '攻擊',
    '방어': '防禦',
    '무게': '重量',
    '무기 레벨': '武器等級',
    '방어구 레벨': '防具等級',
    '요구 레벨': '等級限制',
    '장착 : ': '職業限制 :',
    '전 직업': '全職業',

    // 武器種類
    '단검': '短劍',
    '검': '單手劍',
    '한손 지팡이': '單手杖',
    '한손창': '單手槍',
    '책': '書',
    '너클': '拳套',

    // 職業
    '노비스': '初學者',

    '검사': '劍士',
    '룬나이트': '盧恩騎士',
    '로얄가드': '皇家禁衛隊',
    '드래곤 나이트': '盧恩龍爵',
    '임페리얼 가드': '帝國聖衛軍',

    '복사': '服事',
    '아크비숍': '大主教',
    '수라': '修羅',
    '카디날': '樞機主教',
    '인퀴지터': '聖裁者',

    '마법사': '魔法師',
    '워록': '咒術士',
    '소서러': '妖術師',
    '아크메이지': '禁咒魔導士',
    '엘레멘탈 마스터': '元素支配者',

    '상인': '商人',
    '미케닉': '機械工匠',
    '제네릭': '基因學者',
    '마이스터': '機甲神匠',
    '바이올로': '生命締造者',

    '궁수계열': '弓箭手',
    '레인저': '遊俠',
    '민스트럴': '宮廷樂師',
    '원더러': '浪跡舞者',
    '윈드호크': '風鷹狩獵者',
    '트루베르': '天籟頌者',
    '트루바두르': '月之舞靈',

    '도둑': '盜賊',
    '길로틴크로스': '十字斬首者',
    '쉐도우체이서': '魅影追蹤者',
    '쉐도우 크로스': '十字影武',
    '어비스 체이서': '深淵追跡者',

    '권성': '拳聖',
    '소울링커': '悟靈士',
    '성제': '拳皇',
    '소울리퍼': '獵靈士',
    '천제': '天帝',
    '영도사': '靈導士',

    '건슬링거전용': '神槍手',
    '리벨리온': '叛亂者',
    '나이트 워치': '夜巡者',

    '닌자': '忍者',
    '카게로우': '影狼 (日影忍者)',
    '오보로': '朧 (月影忍者)',
    '신키로': '蜃氣樓',
    '시라누이': '不知火',

    '슈퍼노비스': '超級初學者',
    '하이퍼 노비스': '頂級初學者',

    '소환사': '召喚師',
    '도람족': '喵族',
    '혼령사': '魂靈師',

    // 精煉相關
    '2제련당': '精煉值每 + 2 時',
    '3제련당': '精煉值每 + 3 時',
    '4제련당': '精煉值每 + 4 時',
    '5제련당': '精煉值每 + 5 時',
    '2제련 당': '精煉值每 + 2 時',
    '3제련 당': '精煉值每 + 3 時',
    '4제련 당': '精煉值每 + 4 時',
    '5제련 당': '精煉值每 + 5 時',
    '7제련 시': '精煉值達 + 7 或以上時',
    '8제련 시': '精煉值達 + 8 或以上時',
    '9제련 시': '精煉值達 + 9 或以上時',
    '10제련 시': '精煉值達 +10 或以上時',
    '11제련 시': '精煉值達 +11 或以上時',
    '12제련 시': '精煉值達 +12 或以上時',
    '13제련 시': '精煉值達 +13 或以上時',
    '14제련 시': '精煉值達 +14 或以上時',

    // 階級相關
    '[등급별 추가 옵션]': '[各階級追加效果]',
    '[D등급]': '- [D 階級]',
    '[C등급]': '- [C 階級]',
    '[B등급]': '- [B 階級]',
    '[A등급]': '- [A 階級]',
    '의 등급이': '的階級達到 ',
    '등급 이상인 경우': ' 階級或以上時',

    // Other
    '  ': ' '
}