keywordDict = {
    '노비스': '初學者',

    '검사': '劍士',
    '복사': '服事',
    '마법사': '魔法師',
    '상인': '商人',
    '궁수계열': '弓箭手',
    '도둑': '盜賊',

    // 盧恩騎士 - 盧恩龍爵
    '룬나이트': '盧恩騎士',
    '드래곤 나이트': '盧恩龍爵',

    '이그니션 브레이크': '致命爆裂',

    '핵 앤드 슬래셔': '橫揮斬',
    '스톰 슬래쉬': '風暴斬擊',
    '드래고닉 브레스': '天龍氣息',
    '매드니스 크러셔': '狂暴粉碎',

    // 皇家禁衛軍 - 帝國聖衛軍
    '로얄가드': '皇家禁衛隊',
    '임페리얼 가드': '帝國聖衛軍',

    '배니싱 포인트': '放逐攻擊',
    '캐논 스피어': '加農砲攻擊',
    '레이 오브 제네시스': '創世之光',

    '크로스 레인': '聖十字雨',
    '오버 슬래쉬': '瞬間斬擊',

    // 咒術士 - 禁咒魔導士
    '워록': '咒術士',
    '아크메이지': '禁咒魔導士',

    '크림즌 록': '碧血隕石',
    '헬 인페르노': '地獄火焰',
    '커미트': '毀滅彗星',

    '소울 발칸 스트라이크': '靈魂連擊',
    '미스터리 일루전': '神秘幻滅',
    '프로즌 슬래쉬': '冰刃斬',
    '레인 오브 크리스탈': '冰晶飛瀑',

    // 妖術師 - 元素支配者
    '소서러': '妖術師',
    '엘레멘탈 마스터': '元素支配者',

    '사이킥 웨이브': '超自然波',

    '베놈 스웜프': '毒液沼澤',
    '컨프래그레이션': '惡火吞噬',
    '다이아몬드 스톰': '鑽石風暴',
    '테라 드라이브': '地殼衝擊',

    // 大主教 - 樞機主教
    '아크비숍': '大主教',
    '카디날': '樞機主教',

    '쥬덱스': '審判',
    '아도라무스': '謳歌',

    '페티티오': '聖光打擊',
    '플라멘': '聖靈鎮魂',
    '아르비트리움': '制裁謳歌',

    // 修羅 - 聖裁者
    '수라': '修羅',
    '인퀴지터': '聖裁者',

    '지뢰진': '地雷震',
    '폭기산탄': '爆氣散彈',

    '폭화신탄': '爆破衝擊',
    '성유세례': '聖油洗禮',
    '제3격 : 단죄': '第三擊：懲治',
    '제1격 : 낙인': '第一擊：烙印',

    // 機械工匠 - 機甲神匠
    '미케닉': '機械工匠',
    '마이스터': '機甲神匠',

    '암즈 캐논': '加農砲',

    '트리플 레이저': '三重鐳射',
    '마이티 스매쉬': '威力粉碎',
    '액스 스톰프': '戰斧踏滅',

    // 基因學者 - 生命締造者
    '제네릭': '基因學者',
    '바이올로': '生命締造者',

    '카트 캐논': '手推車加農砲',

    '메이헤믹 쏜즈': '混亂荊棘',
    '익스플로시브 파우더': '爆炸粉末',

    // 十字斬首者 - 十字影武
    '길로틴크로스': '十字斬首者',
    '쉐도우 크로스': '十字影武',

    '임팩트 크레이터': '神力撞擊',
    '이터널 슬래쉬': '永恆斬擊',
    '세비지 임펙트': '野蠻衝擊',

    // 魅影追蹤者 - 深淵追跡者
    '쉐도우체이서': '魅影追蹤者',
    '어비스 체이서': '深淵追跡者',

    '트라이앵글 샷': '三角射擊',

    '체인 리액션 샷': '連鎖射擊',
    '프렌지 샷': '狂暴射擊',
    '어비스 대거': '深淵匕首',
    '데프트 스탭': '靈巧刺擊',

    // 遊俠 - 風鷹狩獵者
    '레인저': '遊俠',
    '윈드호크': '風鷹狩獵者',

    '샤프 슈팅': '銳利射擊',
    '애로우 스톰': '箭雨風暴',

    '플레임 트랩': '火焰陷阱',
    '솔리드 트랩': '盤石陷阱',
    '스위프트 트랩': '急速陷阱',
    '딥 블라인드 트랩': '深盲陷阱',
    '크레시브 볼트': '漸進狙擊',
    '가일 스톰': '毀滅風暴',

    // 宮廷樂師 & 浪跡舞者 - 天籟頌者 & 月之舞靈
    '민스트럴': '宮廷樂師',
    '트루베르': '天籟頌者',
    '원더러': '浪跡舞者',
    '트루바두르': '月之舞靈',

    '서비어 레인스톰': '大暴雨',

    '메탈릭 퓨리': '金屬狂怒',
    '사운드 블렌드': '混聲烙印',
    '리듬 슈팅': '節奏射擊',
    '로제 블라썸': '玫瑰箭矢',

    // 影狼 & 朧 - 日影忍者 & 月影忍者
    '카게로우': '影狼 (日影忍者)',
    '신키로': '蜃氣樓',
    '오보로': '朧 (月影忍者)',
    '시라누이': '不知火',

    '홍염화': '火炎花',
    '빙섬창': '冰閃槍',
    '풍인': '風刃',
    '팔방 쿠나이': '八方飛刀',

    '암전포': '暗轉砲',
    '적염포': '赤炎砲',
    '풍마수리검-구축': '風魔 - 構築',
    '풍마수리검-장악': '風魔 - 掌握',

    // 拳皇 - 天帝
    '성제': '拳皇',
    '천제': '天帝',

    '태천일월': '太天壹月',
    '천월': '天月',
    '태천일양': '太天壹陽',
    '천양': '天陽',

    // 獵靈士 - 靈導士
    '소울리퍼': '獵靈士',
    '영도사': '靈導士',

    '에스파': '艾斯弗',
    '에스후': '艾斯帕',

    '사령정화': '邪靈淨化',
    '영도부': '靈導符',
    '사방신부': '四方神符',
    '주작부': '朱雀符',

    // 超級初學者 - 頂級初學者
    '슈퍼노비스': '超級初學者',
    '하이퍼 노비스': '頂級初學者',

    '네이팜 발칸 스트라이크': '念力直擊',
    '그라운드 그라비테이션': '重力曠野',
    '쉴드 체인 러쉬': '連續盾牌衝擊',
    '스파이럴 피어스 맥스': '最大螺旋擊刺',

    // 召喚師 (喵族) - 魂靈師
    '소환사': '召喚師',
    '도람족': '喵族',
    '혼령사': '魂靈師',

    '개박하 메테오': '貓薄荷隕石',
    '개다래 줄기창': '獼猴桃梗槍',

    '현록포': '玄鹿炮',
    '현록의 잎새바람': '玄鹿葉旋風',
    '철호 허공할퀴기': '鐵虎虛空爪',
    '호고공 난타': '虎號哭亂打',

    // 叛亂者 - 夜巡者
    '리벨리온': '叛亂者',
    '나이트 워치': '夜巡者',

    '해머 오브 갓': '天神憤怒',

    '스파이럴 슈팅': '螺旋射擊',
    '와일드 파이어': '狂烈野火',
    '온리 원 블릿': '一發入魂',
    '매거진 포 원': '耗盡彈匣',
    '더 비질랜트 엣 나이트': '黑夜私兵',
    '헤이스티 파이어 인더 홀': '急速爆炸',
    '그레네이즈 드롭핑': '榴彈殞落',

    // 屬性
    '속성': '屬性',
    '무': '無',
    '화': '火',
    '수': '水',
    '풍': '風',
    '지': '地',
    '독': '毒',
    '염': '念',
    '암': '暗',
    '성': '聖',
    '불사': '不死',

    // 種族
    '악마형': '惡魔種族',
    '불사형': '不死種族',
    '모든 종족의 적에게 주는': '對所有種族敵人的',

    // 體型
    '소형': '小型體型',
    '중형': '中型體型',
    '대형': '大型體型',
    '모든 크기 적에게 주는': '對所有體型敵人的',

    // 階級
    '보스 등급 몬스터에게 주는': '對 Boss 階級魔物的',

    // 物理
    '물리': '物理',
    '근접': '近距離',
    '근접 물리 데미지': '近距離物理傷害',
    '원거리 물리 데미지': '遠距離物理傷害',
    '크리티컬 데미지': '暴擊傷害',
    '유도 공격 확률': '誘導攻擊',

    // 魔法
    '마법': '魔法',
    '모든 속성 마법 데미지': '所有屬性的魔法傷害',
    '속성 마법 데미지': '屬性的魔法傷害',


    // 其他效果
    '고정 캐스팅': '固定詠唱時間',
    '변동 캐스팅': '變動詠唱時間',
    '공격속도': '攻擊速度',
    '공격 속도': '攻擊速度',
    '공격 후딜레이': '攻擊後延遲',
    '스킬 쿨타임': '獨立延遲',
    '스킬 후 딜레이': '共通技能後延遲',
    '글로벌 쿨타임': '共通技能後延遲',
    '일반 근접 물리 공격 시, 일정 확률로': '一般近距離物理攻擊時，一定機率',
    '일반 근접 물리 공격 시 일정 확률로': '一般近距離物理攻擊時，一定機率',
    '파괴 불가': '無法破壞',
    '초': '秒',

    // 敘述
    '추가': '追加',
    '데미지': '傷害',
    '추가 증가': '追加增加',
    '초 감소': ' 秒減少',
    '혹은': '或',
    '와 함께 장착 시': ' 同時裝備時',
    '과 함께 장착 시': '同時裝備時',
    '과 함께 장착한 경우': '同時裝備時',
    '씩 증가': ' 增加',
    '증가': '增加',
    '감소': '減少',
    '발동': '發動',

    // 一般說明
    '계열': '系列',
    '무기': '武器',
    '투구': '頭飾',
    '위치': '部位',
    '상단': '上段',
    '갑옷': '鎧甲',
    '걸칠것': '披肩',
    '신발': '鞋子',
    '공격': '攻擊',
    '방어': '防禦',
    '무게': '重量',
    '무기 레벨': '武器等級',
    '방어구 레벨': '防具等級',
    '요구 레벨': '等級限制',
    '장착 : ': '職業限制 : ',
    '전 직업': '全職業',

    // 武器種類
    '단검': '短劍',
    '검': '單手劍',
    '한손 지팡이': '單手杖',
    '한손창': '單手槍',
    '책': '書',
    '너클': '拳套',
    '그레네이드런처': '榴彈發射器',
    '리볼버': '左輪手槍',
    '개틀링건': '格林機槍',
    '샷건': '霰彈槍',
    '라이플': '來福槍',

    // 精煉相關
    '2제련당': '精煉值每 + 2 時',
    '3제련당': '精煉值每 + 3 時',
    '4제련당': '精煉值每 + 4 時',
    '5제련당': '精煉值每 + 5 時',
    '2제련 당': '精煉值每 + 2 時',
    '3제련 당': '精煉值每 + 3 時',
    '4제련 당': '精煉值每 + 4 時',
    '5제련 당': '精煉值每 + 5 時',
    '7제련 시': '精煉值達 + 7 或以上時',
    '8제련 시': '精煉值達 + 8 或以上時',
    '9제련 시': '精煉值達 + 9 或以上時',
    '10제련 시': '精煉值達 +10 或以上時',
    '11제련 시': '精煉值達 +11 或以上時',
    '12제련 시': '精煉值達 +12 或以上時',
    '13제련 시': '精煉值達 +13 或以上時',
    '14제련 시': '精煉值達 +14 或以上時',

    // 階級相關
    '[등급별 추가 옵션]': '[各階級追加效果]',
    '[D등급]': '- [D 階級]',
    '[C등급]': '- [C 階級]',
    '[B등급]': '- [B 階級]',
    '[A등급]': '- [A 階級]',
    '의 등급이': '階級達到 ',
    '등급 이상인 경우': ' 階級或以上時',

    // Other
    '  ': ' '
}